Data/ideal_case/s_0/0/include/sideAndTopPatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

top
{
    type symmetry;
}

sides
{
    type symmetry;
}

"proc.*"
{
    type            processor;
}

// ************************************************************************* //
