Data/ideal_case/s_0/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #include "include/ABLConditions"

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    terrain
    {
        type            nutkAtmz0RoughWallFunction;
        z0              $z0_terrain;
        value           uniform 0.0;
    }

    green1
    {
        type            nutkAtmz0RoughWallFunction;
        z0              $z0_green1;
        value           uniform 0.0;
    }

    water
    {
        type            nutkAtmz0RoughWallFunction;
        z0              $z0_water;
        value           uniform 0.0;
    }

    green2
    {
        type            nutkAtmz0RoughWallFunction;
        z0              $z0_green2;
        value           uniform 0.0;
    }
   


    ground
    {
        type            calculated;
        value           uniform 0;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
